using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class CellData
{
    // 순번, 별 갯수, 이름, 설명, 오브젝트 이름, 도감 등록 여부
    // 각 도감별 세포 순서 똑같이 데이터화 해야함!
    // 별 갯수가 바뀌면 순번도 바뀜!
    public static string[,] CellDataArray =
      {
        // # 0성
        {"1", "0", "세포 R", "설명설명", "lv0_red1", "x" },
        {"2", "0", "세포 Y", "세포 Y", "lv0_yellow1", "x"},
        {"3", "0", "세포 W", "세포 W", "lv0_white1", "x"},

        // # 1성
        {"1", "1", "[1]뿔빨", "빨간1-1", "lv1_red1", "x"},
        {"2", "1", "[1]궁예", "빨간1-2", "lv1_red2", "x"},
        {"3", "1", "[1]뚝배기", "빨간1-3", "lv1_red3", "x"},
        {"4", "1", "[1]눈빛남", "노란1-1", "lv1_yellow1","x"},
        {"5", "1", "[1]상처", "노란1-2", "lv1_yellow2", "x"},
        {"6", "1", "[1]깃털", "노란1-3", "lv1_yellow3", "x"},
        {"7", "1", "[1]약빰", "흰색1-1", "lv1_white1", "x"},
        {"8", "1", "[1]안경", "흰색1-2", "lv1_white2", "x"},
        {"9", "1", "[1]간호사", "흰색1-3", "lv1_white3", "x"},

        // # 2성
        {"1", "2", "[2]뿔방패", "빨간2-1", "lv2_red1", "x"},
        {"2", "2", "[2]궁예칼", "빨간2-2", "lv2_red2", "x"},
        {"3", "2", "[2]뚝배기칼", "빨간2-3", "lv2_red3", "x"},
        {"4", "2", "[2]눈빛남총", "노란2-1", "lv2_yellow1", "x"},
        {"5", "2", "[2]상처칼", "노란2-2", "lv2_yellow2", "x"},
        {"6", "2", "[2]깃털궁수", "노란2-3", "lv2_yellow3", "x"},
        {"7", "2", "[2]약쟁이", "흰색2-1", "lv2_white1", "x"},
        {"8", "2", "[2]안경팔이", "흰색2-2", "lv2_white2", "x"},
        {"9", "2", "[2]간호사?", "흰색2-3", "lv2_white3", "x"}

        // # 3성

        // # 4성

        // # 스페셜(5성)
    };

    public static int level1SetCount;
}
